# Flip Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..Flip Method
DividedPath Class See Also
---
Toggle the flipped value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace